In [1]:
#以下测试为3.7.0版本测试结果
import pandas as pd
import cx_Oracle #oracle驱动
import sqlalchemy

In [16]:
conn=sqlalchemy.create_engine('oracle://scott:m123@localhost:1521/ORCL')

In [17]:
sql='select * from scott.Salgrade'
d0=pd.read_sql(sql,conn)

In [18]:
df=pd.DataFrame(d0)
df

   grade  losal  hisal
0      1    700   1200
1      2   1201   1400
2      3   1401   2000
3      4   2001   3000
4      5   3001   9999